backend/tests/load-test-5000.yml
config:
  target: 'http://localhost:3333'
  phases:
    - duration: 60
      arrivalRate: 5000
scenarios:
  - flow:
      - post:
          url: '/sensor_data'
          json:
            equipment_id: 'EQ-00001'
            timestamp: "{{ now 'iso8601' }}"
            value: "{{ randomNumber(1, 100) }}"